{"intents": [
    {"tag": "greeting",
     "patterns": 
        [
            "hey", 
            "hello", 
            "hi", 
            "Hola", 
            "hello there", 
            "good morning", 
            "good evening", 
            "moin", 
            "hey there",
            "let's go",
            "hey dude", 
            "goodmorning",
            "goodevening",
            "good afternoon",
            "is anyone there?",
            "Good day"
        ],
     "responses": 
        [
            "Hello!", 
            "Good to see you", 
            "Hi there, how can I help?"
        ],
     "context": [""]
    },
    {"tag": "goodbye",
     "patterns": 
        [   
            "cu",
            "good by",
            "cee you later",
            "good night",
            "bye",
            "goodbye",
            "have a nice day",
            "see you around",
            "bye bye",
            "see you later",
            "ciao",
            "see you later, ciao",
            "nice chatting with you, bye", 
            "till next time"
        ],
     "responses": 
        [
            "See you!", 
            "Have a nice day", 
            "Bye! Come back again soon."
        ],
     "context": [""]
    },
    {"tag": "thanks",
     "patterns": 
        [
            "thanks", 
            "thank you", 
            "that's helpful", 
            "awesome, thanks", 
            "thanks for helping me"
        ],
     "responses": 
        [
            "Happy to help!", 
            "Any time!", 
            "My pleasure"
        ],
     "context": [""]
    },
    {"tag": "noanswer",
     "patterns": [""],
     "responses": 
        [
            "Sorry, can't understand you", 
            "Please give me more info", 
            "Not sure I understand"
        ],
     "context": [""]
    },
    {"tag": "options",
     "patterns": 
        [
            "How can help me?", 
            "What you can do?", 
            "What help you provide?", 
            "How you can be helpful?", 
            "What support is offered"
        ],
     "responses": 
        [
            "I can answer your questions about diabetes and look for nearby endocrinologists", 
            "Answering diabetes related questions and looking for nearby endocrinologists."
        ],
     "context": [""]
    },
    {"tag" : "define_diabetes",
    "patterns" : 
        [
            "what is diabetes",
            "define diabetes", 
            "what's the meaning of diabetes", 
            "is diabetes chronic", 
            "what does diabetes mean", 
            "is diabetes a lifelong disease",
            "is diabetes a disease"
        ],
    "responses" : 
        [
            "Diabetes is a chronic (long-lasting) health condition that affects how your body turns food into energy.\nMost of the food you eat is broken down into sugar (also called glucose) and released into your bloodstream. When your blood sugar goes up, it signals your pancreas to release insulin. Insulin acts like a key to let the blood sugar into your body’s cells for use as energy.\nIf you have diabetes, your body either doesn’t make enough insulin or can’t use the insulin it makes as well as it should. When there isn’t enough insulin or cells stop responding to insulin, too much blood sugar stays in your bloodstream. Over time, that can cause serious health problems, such as heart disease, vision loss, and kidney disease.\nThere isn’t a cure yet for diabetes, but losing weight, eating healthy food, and being active can really help. Taking medicine as needed, getting diabetes self-management education and support, and keeping health care appointments can also reduce the impact of diabetes on your life.",
            "Diabetes is a chronic disease that occurs either when the pancreas does not produce enough insulin or when the body cannot effectively use the insulin it produces. Insulin is a hormone that regulates blood sugar. Hyperglycaemia, or raised blood sugar, is a common effect of uncontrolled diabetes and over time leads to serious damage to many of the body's systems, especially the nerves and blood vessels.","Diabetes is a disease that occurs when your blood glucose, also called blood sugar, is too high. Blood glucose is your main source of energy and comes from the food you eat. Insulin, a hormone made by the pancreas, helps glucose from food get into your cells to be used for energy. Sometimes your body doesn’t make enough—or any—insulin or doesn’t use insulin well. Glucose then stays in your blood and doesn’t reach your cells.\nOver time, having too much glucose in your blood can cause health problems. Although diabetes has no cure, you can take steps to manage your diabetes and stay healthy.\nSometimes people call diabetes “a touch of sugar” or “borderline diabetes.” These terms suggest that someone doesn’t really have diabetes or has a less serious case, but every case of diabetes is serious."
        ],
    "context" : [""]
    },
    {"tag": "get_diabetes_types",
    "patterns" : 
        [
            "what are the types of diabetes", 
            "how many types of diabetes are there", 
            "can you explain what are the types of diabetes"
        ],
    "responses" : 
        [
            "Type 1\n\nIn type 1 diabetes, the body does not produce insulin.\n\n\n\nType 2:\n\nType 2 diabetes is the most common form of diabetes—and it means that your body doesn’t use insulin properly.\n\n\n\nGestational diabetes:\n\nGestational diabetes is diabetes diagnosed for the first time during pregnancy (gestation).\n\n\nPrediabetes:\n\nWhen it comes to prediabetes, there are no clear symptoms—so you may have it and not know it. Here’s why that’s important: before people develop type 2 diabetes, they almost always have prediabetes—blood sugar levels that are higher than normal but not yet high enough to be diagnosed as diabetes.",
            "Types of Diabetes\n\n\nType 1 Diabetes:\nType 1 diabetes is thought to be caused by an autoimmune reaction (the body attacks itself by mistake) that stops your body from making insulin.\n\n\nType 2 Diabetes:\nWith type 2 diabetes, your body doesn’t use insulin well and can’t keep blood sugar at normal levels.\n\n\nGestational Diabetes:\nGestational diabetes develops in pregnant women who have never had diabetes. If you have gestational diabetes, your baby could be at higher risk for health problems. Gestational diabetes usually goes away after your baby is born but increases your risk for type 2 diabetes later in life. Your baby is more likely to have obesity as a child or teen, and more likely to develop type 2 diabetes later in life too.\n\n\nPrediabetes:\n With prediabetes, blood sugar levels are higher than normal, but not high enough yet to be diagnosed as type 2 diabetes.","Type 1 diabetes:\n\nType 1 diabetes is characterized by deficient insulin production and requires daily administration of insulin.\n\n\nType 2 diabetes:\n\nType 2 diabetes results from the body’s ineffective use of insulin.\n\n\nGestational diabetes:\n\nGestational diabetes occurs during pregnancy.Women with gestational diabetes are at an increased risk of complications during pregnancy and at delivery. These women and possibly their children are also at increased risk of type 2 diabetes in the future.\n\n\nPrediabetes:\n\nWhen it comes to prediabetes, there are no clear symptoms—so you may have it and not know it. Here’s why that’s important: before people develop type 2 diabetes, they almost always have prediabetes—blood sugar levels that are higher than normal but not yet high enough to be diagnosed as diabetes." 
        ],
    "context": [""]
    },
    {"tag" : "diabetes_symptoms",
    "patterns" : 
        [
            "what are the symptoms of diabetes",
            "what are the signs of diabetes",
            "what are the indicators of diabetes",
            "list the symptoms of diabetes"
        ],
    "responses" : 
        [
            "The general symptoms of diabetes include:\n  -Increased hunger\n  -Increased thirst\n  -Weight loss\n  -Frequent urination\n  -Blurry vision\n  -Extreme fatigue\n  -Sores that don’t heal"
        ],
    "context" : [""]
    },
    {"tag" : "type1_symptoms",
    "patterns" : 
        [
            "what are the symptoms of type 1 diabetes",
            "what are the signs of type 1 diabetes",
            "what are the indicators of type 1 diabetes",
            "list the symptoms of type 1 diabetes", 
            "what are the symptoms of type1",
            "what are the signs of type 1",
            "what are the indicators of type 1",
            "list the symptoms of type 1"
        ],
    "responses" : 
        [
            "Type 1 diabetes signs and symptoms can appear relatively suddenly and may include:\n  -Increased thirst\n  -Frequent urination\n  -Bed-wetting in children who previously didn't wet the bed during the night\n  -Extreme hunger\n  -Unintended weight loss\n  -Irritability and other mood changes\n  -Fatigue and weakness\n  -Blurred vision"
        ],
    "context" : [""]
    },
    {"tag" : "type2_symptoms",
    "patterns" : 
        [
            "what are the symptoms of type 2 diabetes",
            "what are the signs of type 2 diabetes",
            "what are the indicators of type 2 diabetes",
            "list the symptoms of type 2 diabetes", 
            "what are the symptoms of type2",
            "what are the signs of type 2",
            "what are the indicators of type 2",
            "list the symptoms of type 2"
        ],
    "responses" : 
        [
            "Signs and symptoms of type 2 diabetes often develop slowly. In fact, you can be living with type 2 diabetes for years and not know it. When signs and symptoms are present, they may include:\n  -Increased thirst\n  -Frequent urination\n  -Increased hunger\n  -Unintended weight loss\n  -Fatigue\n  -Blurred vision\n  -Slow-healing sores\n  -Frequent infections\n  -Numbness or tingling in the hands or feet\n  -Areas of darkened skin, usually in the armpits and neck"
        ],
    "context" : [""]
    },
    {"tag": "define_type1_diabetes",
    "patterns": 
        [
            "what is Type 1 Diabetes","define type 1 diabetes","what is Type 1","can you explain type 1 diabetes"
        ],
    "responses": 
        [
            "Understanding type 1\n\nIn type 1 diabetes, the body does not produce insulin. The body breaks down the carbohydrates you eat into blood sugar (blood glucose) that it uses for energy—and insulin is a hormone that the body needs to get glucose from the bloodstream into the cells of the body. With the help of insulin therapy and other treatments, everyone can learn to manage their condition and live long, healthy lives.","Type 1 diabetes is thought to be caused by an autoimmune reaction (the body attacks itself by mistake) that stops your body from making insulin. Approximately 5-10% of the people who have diabetes have type 1. Symptoms of type 1 diabetes often develop quickly. It’s usually diagnosed in children, teens, and young adults. If you have type 1 diabetes, you’ll need to take insulin every day to survive. Currently, no one knows how to prevent type 1 diabetes.","Type 1 diabetes (previously known as insulin-dependent, juvenile or childhood-onset) is characterized by deficient insulin production and requires daily administration of insulin. Neither the cause of Type 1 diabetes nor the means to prevent it are known.\nSymptoms include excessive excretion of urine (polyuria), thirst (polydipsia), constant hunger, weight loss, vision changes, and fatigue. These symptoms may occur suddenly."
        ],
    "context": [""]
    },
    {"tag": "define_type2_diabetes",
    "patterns": 
        [
            "what is Type 2 Diabetes","define type 2 diabetes","what is Type 2","can you explain type 2 diabetes"
        ],
    "responses": 
        [
            "Understanding type 2:\n\nType 2 diabetes is the most common form of diabetes—and it means that your body doesn’t use insulin properly. And while some people can control their blood sugar levels with healthy eating and exercise, others may need medication or insulin to help manage it. Regardless, you have options—and we're here with the tools, resources, and support you need.\nA key part of managing type 2 diabetes is maintaining a healthy diet. You need to eat something sustainable that helps you feel better and still makes you feel happy and fed. Remember, it’s a process. Work to find helpful tips and diet plans that best suit your lifestyle—and how you can make your nutritional intake work the hardest for you.\nFitness is another key to managing type 2. And the good news, all you have to do is get moving. The key is to find activities you love and do them as often as you can. No matter how fit you are, a little activity every day can help you put yourself in charge of your life.","Type 2 Diabetes:\nWith type 2 diabetes, your body doesn’t use insulin well and can’t keep blood sugar at normal levels. About 90-95% of people with diabetes have type 2. It develops over many years and is usually diagnosed in adults (but more and more in children, teens, and young adults). You may not notice any symptoms, so it’s important to get your blood sugar tested if you’re at risk. Type 2 diabetes can be prevented or delayed with healthy lifestyle changes, such as losing weight, eating healthy food, and being active.","Type 2 diabetes:\n\nType 2 diabetes (formerly called non-insulin-dependent, or adult-onset) results from the body’s ineffective use of insulin. The majority of people with diabetes have type 2 diabetes. This type of diabetes is largely the result of excess body weight and physical inactivity.\nSymptoms may be similar to those of type 1 diabetes, but are often less marked. As a result, the disease may be diagnosed several years after onset, after complications have already arisen.\nUntil recently, this type of diabetes was seen only in adults but it is now also occurring increasingly frequently in children."
        ],
    "context": [""]
    },
    {"tag": "define_gestational_diabetes",
    "patterns": 
        [
            "what is gestational diabetes",
            "define gestational diabetes",
            "What's the definiton of gestational diabetes",
            "give me a definition of gestational diabetes",
            "I can't understand gestational diabetes",
            "can you explain the term gestational", 
            "I can't seem to get gestational diabetes, can you explain",
            "what's the name of the diabetes that develops during the pregnancy",
            "what's the type of diabetes that develops during the pregnancy",
            "what's diabetes that appears during pregancy",
            "can a woman get diabetes while pregnant",
            "can diabetes affect a pregnant woman"
            ],
    "responses": 
        [
            "Gestational diabetes is high blood sugar (glucose) that develops during pregnancy and usually disappears after giving birth. It can happen at any stage of pregnancy, but is more common in the second or third trimester.",
            "Gestational diabetes is diabetes diagnosed for the first time during pregnancy (gestation). Like other types of diabetes, gestational diabetes affects how your cells use sugar (glucose). Gestational diabetes causes high blood sugar that can affect your pregnancy and your baby's health.",
            "Gestational diabetes is a condition in which your blood sugar levels become high during pregnancy. It affects pregnant women who haven’t ever been diagnosed with diabetes.",
            "Gestational diabetes is a type of diabetes that is first seen in a pregnant woman who did not have diabetes before she was pregnant. Some women have more than one pregnancy affected by gestational diabetes. Gestational diabetes usually shows up in the middle of pregnancy."
        ],
    "context": [""]
    },
    {"tag" : "gestational_causes",
    "patterns" : [
        "what causes gestational diabetes",
        "what can cause gestational diabetes",
        "are there any direct causes of gestational diabetes",
        "what's the root of gestational diabetes",
        "what's the origin of gestational diabetes",
        "what are the prinicipal sources of gestational diabetes",
        "what are the things that result in gestational diabetes",
        "what are the causes that result in gestational diabetes"
    ],
    "responses" : [
        "Researchers don't yet know why some women get gestational diabetes and others don't. Excess weight before pregnancy often plays a role.\n\nNormally, various hormones work to keep your blood sugar levels in check. But during pregnancy, hormone levels change, making it harder for your body to process blood sugar efficiently. This makes your blood sugar rise."
    ],
    "context" : [""]
    },
    {"tag" : "gestational_affects_babies",
    "patterns" : [
        "does gestational diabetes affect the baby",
        "what are the symptoms of gestational diabetes on babies",
        "what are invelved with gestational diabetes",
        "can gestational diabetes affect the baby",
        "can gestational diabetes hurt the baby",
        "how does gestational diabetes affect the baby",
        "can gestational diabetes have an on the baby too",
        "what are the aftermaths of gestational diabetes on the baby",
        "what are the consequences of gestational diabetes on the health of the baby"
    ],
    "responses":[
        "Babies of mothers who have gestational diabetes have a higher risk of developing obesity and type 2 diabetes later in life. Stillbirth. Untreated gestational diabetes can result in a baby's death either before or shortly after birth.",
        "Diabetes that is not well controlled causes the baby’s blood sugar to be high. The baby is “overfed” and grows extra large. Besides causing discomfort to the woman during the last few months of pregnancy, an extra large baby can lead to problems during delivery for both the mother and the baby. The mother might need a C-Section to deliver the baby. The baby can be born with nerve damage due to pressure on the shoulder during delivery."
    ],
    "context" : [""]
    },
    {"tag": "define_prediabetes",
    "patterns": 
        [
            "what is Prediabetes",
            "define prediabetes",
            "can you explain prediabetes", 
            "what is the meaning of prediabetes",
            "what does prediabetes mean"
        ],
    "responses": ["When it comes to prediabetes, there are no clear symptoms—so you may have it and not know it. Here’s why that’s important: before people develop type 2 diabetes, they almost always have prediabetes—blood sugar levels that are higher than normal but not yet high enough to be diagnosed as diabetes. You may have some of the symptoms of diabetes or even some of the complications.\nRegardless, check with your doctor and get tested. If you discover that you do have prediabetes, remember that it doesn’t mean you’ll develop type 2, particularly if you follow a treatment plan and a diet and exercise routine. Even small changes can have a huge impact on managing diabetes or preventing it all together—so get to a doctor today and get tested.","Prediabetes:\nIn the United States, 88 million adults—more than 1 in 3—have prediabetes. What’s more, more than 84% of them don’t know they have it. With prediabetes, blood sugar levels are higher than normal, but not high enough yet to be diagnosed as type 2 diabetes. Prediabetes raises your risk for type 2 diabetes, heart disease, and stroke.","Prediabetes:\n\nWhen it comes to prediabetes, there are no clear symptoms—so you may have it and not know it. Here’s why that’s important: before people develop type 2 diabetes, they almost always have prediabetes—blood sugar levels that are higher than normal but not yet high enough to be diagnosed as diabetes. You may have some of the symptoms of diabetes or even some of the complications.\nRegardless, check with your doctor and get tested. If you discover that you do have prediabetes, remember that it doesn’t mean you’ll develop type 2, particularly if you follow a treatment plan and a diet and exercise routine. Even small changes can have a huge impact on managing diabetes or preventing it all together—so get to a doctor today and get tested."],
    "context": [""]
    },
    {"tag": "type1_risk_factors",
    "patterns": 
        ["what are the risks that may lead to type 1 diabetes","what are the risk factors for type 1 diabetes", "what are the factors for type 1 diabetes","What Increases My Risk of type 1 Diabetes"],
    "responses": 
        [
            "Type 1 diabetes is thought to be caused by an immune reaction (the body attacks itself by mistake). Risk factors for type 1 diabetes are not as clear as for prediabetes and type 2 diabetes. Known risk factors include:\n    Family history: Having a parent, brother, or sister with type 1 diabetes.\n    Age: You can get type 1 diabetes at any age, but it’s more likely to develop when you’re a child, teen, or young adult.\nIn the United States, whites are more likely to develop type 1 diabetes than African Americans and Hispanic/Latino Americans.\nCurrently, no one knows how to prevent type 1 diabetes.","Type 1\n\nThis type usually starts in childhood. Your pancreas stops making insulin. You have type 1 diabetes for life. The main things that lead to it are:\n  Family history. If you have relatives with diabetes, chances are higher that you’ll get it, too. Anyone who has a mother, father, sister, or brother with type 1 diabetes should get checked. A simple blood test can diagnose it.\n  Diseases of the pancreas. They can slow its ability to make insulin.\n  Infection or illness. Some infections and illnesses, mostly rare ones, can damage your pancreas.","Some known risk factors for type 1 diabetes include:\n  Family history. Anyone with a parent or sibling with type 1 diabetes has a slightly increased risk of developing the condition.\n  Genetics. The presence of certain genes indicates an increased risk of developing type 1 diabetes.\n  Geography. The incidence of type 1 diabetes tends to increase as you travel away from the equator.\n  Age. Although type 1 diabetes can appear at any age, it appears at two noticeable peaks. The first peak occurs in children between 4 and 7 years old, and the second is in children between 10 and 14 years old."
        ],
    "context": [""]
    },
    {"tag": "type2_risk_factors",
    "patterns": 
        [
            "what are the risks that may lead to type 2 diabetes","what are the risk factors for type 2 diabetes", "what are the factors for type 2 diabetes","What Increases My Risk of type 2 Diabetes"
        ],
    "responses": 
        [
            "If you have this kind, your body can't use the insulin it makes. This is called insulin resistance. Type 2 usually affects adults, but it can begin at any time in your life. The main things that lead to it are:\n  Obesity or being overweight. Research shows this is a top reason for type 2 diabetes. Because of the rise in obesity among U.S. children, this type is affecting more teenagers.\n  Impaired glucose tolerance.Prediabetes is a milder form of this condition. It can be diagnosed with a simple blood test. If you have it, there’s a strong chance you’ll get type 2 diabetes.\n  Insulin resistance.Type 2 diabetes often starts with cells that are resistant to insulin. That means your pancreas has to work extra hard to make enough insulin to meet your body's needs.\n  Ethnic background. Diabetes happens more often in Hispanic/Latino Americans, African-Americans, Native Americans, Asian-Americans, Pacific Islanders, and Alaska natives.\n  Gestational diabetes. If you had diabetes while you were pregnant, you had gestational diabetes. This raises your chances of getting type 2 diabetes later in life.\n  Sedentary lifestyle. You exercise less than three times a week.\n  Family history. You have a parent or sibling who has diabetes.\n  Polycystic ovary syndrome. Women with polycystic ovary syndrome (PCOS) have a higher risk.\n  Age. If you're over 45 and overweight or if you have symptoms of diabetes, talk to your doctor about a simple screening test.","Type 2 Diabetes\n\nYou’re at risk for developing type 2 diabetes if you:\n  Have prediabetes\n  Are overweight\n  Are 45 years or older\n  Have a parent, brother, or sister with type 2 diabetes\n  Are physically active less than 3 times a week\n  Have ever had gestational diabetes (diabetes during pregnancy) or given birth to a baby who weighed more than 9 pounds\n  Are African American, Hispanic/Latino American, American Indian, or Alaska Native (some Pacific Islanders and Asian Americans are also at higher risk)\n\nIf you have non-alcoholic fatty liver disease you may also be at risk for type 2 diabetes.\n\nYou can prevent or delay type 2 diabetes with simple, proven lifestyle changes such as losing weight if you’re overweight, eating healthier, and getting regular physical activity.","Factors that may increase your risk of type 2 diabetes include:\n  Weight. Being overweight or obese is a main risk.\n  Fat distribution. Storing fat mainly in your abdomen — rather than your hips and thighs — indicates a greater risk. Your risk of type 2 diabetes rises if you're a man with a waist circumference above 40 inches (101.6 centimeters) or a woman with a measurement above 35 inches (88.9 centimeters).\n  Inactivity. The less active you are, the greater your risk. Physical activity helps control your weight, uses up glucose as energy and makes your cells more sensitive to insulin.\n  Family history. The risk of type 2 diabetes increases if your parent or sibling has type 2 diabetes.\n  Race and ethnicity. Although it's unclear why, people of certain races and ethnicities — including Black, Hispanic, Native American and Asian people, and Pacific Islanders — are more likely to develop type 2 diabetes than white people are.\n  Blood lipid levels. An increased risk is associated with low levels of high-density lipoprotein (HDL) cholesterol — the \"good\" cholesterol — and high levels of triglycerides.\n  Age. The risk of type 2 diabetes increases as you get older, especially after age 45.\n  Prediabetes. Prediabetes is a condition in which your blood sugar level is higher than normal, but not high enough to be classified as diabetes. Left untreated, prediabetes often progresses to type 2 diabetes.\n  Pregnancy-related risks. Your risk of developing type 2 diabetes increases if you developed gestational diabetes when you were pregnant or if you gave birth to a baby weighing more than 9 pounds (4 kilograms).\n  Polycystic ovary syndrome. Having polycystic ovary syndrome — a common condition characterized by irregular menstrual periods, excess hair growth and obesity — increases the risk of diabetes\n  Areas of darkened skin, usually in the armpits and neck. This condition often indicates insulin resistance."
        ],
    "context": [""]
    },
    {"tag": "prediabetes_risk_factors",
    "patterns": 
        [
            "what are the risks that may lead to Prediabetes","what are the risk factors for Prediabetes", "what are the factors for Prediabetes","What Increases My Risk of Prediabetes"
        ],
    "responses": 
        [
            "The same factors that increase the odds of getting type 2 diabetes also increase the risk of prediabetes. ","There are many factors you can control. Prediabetes is a condition that can lead to type 2 diabetes and even heart disease. Your chances of having prediabetes go up if you:\n\nAre 45 or older\nAre Black, Hispanic/Latino, American Indian, Asian American or Pacific Islander\nHave a parent, brother or sister with diabetes\nAre overweight\nAre physically inactive\nHave high blood pressure or take medicine for high blood pressure\nHave low HDL cholesterol and/or high triglycerides\nHad diabetes during pregnancy\nHave been diagnosed with polycystic ovary syndrome.","Prediabetes\n\nYou’re at risk for developing prediabetes if you:\n  Are overweight\n  Are 45 years or older\n  Have a parent, brother, or sister with type 2 diabetes\n  Are physically active less than 3 times a week\n  Have ever had gestational diabetes (diabetes during pregnancy) or given birth to a baby who weighed more than 9 pounds\n  Are African American, Hispanic/Latino American, American Indian, or Alaska Native (some Pacific Islanders and Asian Americans are also at higher risk)\nYou can prevent or reverse prediabetes with simple, proven lifestyle changes such as losing weight if you’re overweight, eating healthier, and getting regular physical activity. The CDC-led National Diabetes Prevention Program can help you make healthy changes that have lasting results."
        ],
    "context": [""]
    },
    {"tag": "gestational_diabetes_risk_factors",
    "patterns": 
        [
            "what are the risks that may lead to Gestational diabetes","what are the risk factors for Gestational diabetes", "what are the factors for Gestational diabetes","What Increases My Risk of Gestational diabetes"
        ],
    "responses": 
        [
            "Gestational Diabetes\n\nYou’re at risk for developing gestational diabetes (diabetes while pregnant) if you:\n  Had gestational diabetes during a previous pregnancy\n  Have given birth to a baby who weighed more than 9 pounds\n  Are overweight\n  Are more than 25 years old\n  Have a family history of type 2 diabetes\n  Have a hormone disorder called polycystic ovary syndrome (PCOS)\n  Are African American, Hispanic/Latino American, American Indian, Alaska Native, Native Hawaiian, or Pacific Islander\n\nGestational diabetes usually goes away after your baby is born but increases your risk for type 2 diabetes later in life. Your baby is more likely to have obesity as a child or teen, and is more likely to develop type 2 diabetes later in life too.\n\nBefore you get pregnant, you may be able to prevent gestational diabetes by losing weight if you’re overweight, eating healthier, and getting regular physical activity.","Gestational\n\nDiabetes when you’re expecting affects about 4% of all U.S. pregnancies. It's caused by hormones the placenta makes or by too little insulin. High blood sugar from the mother causes high blood sugar in the baby. That can lead to growth and development problems if left untreated. Things that can lead to gestational diabetes include:\n  Obesity or being overweight. Extra pounds can lead to gestational diabetes.\n  Glucose intolerance. Having glucose intolerance or gestational diabetes in the past makes you more likely to get it again.\n  Family history. If a parent or sibling has had gestational diabetes, you're more likely to get it.\n  Age. The older you are when you get pregnant, the higher your chances are.\n  Ethnic background. Nonwhite women have a greater chance of developing it.","Some women have a greater risk of gestational diabetes. Risk factors for gestational diabetes include the following:\n  Overweight and obesity.\n  A lack of physical activity.\n  Previous gestational diabetes or prediabetes.\n  Polycystic ovary syndrome.\n  Diabetes in an immediate family member.\n  Previously delivering a baby weighing more than 9 pounds (4.1 kilograms).\n  Race — Women who are Black, Hispanic, American Indian and Asian American have a higher risk of developing gestational diabetes."
        ],
    "context": [""]
    },
    {"tag" : "define_hypoglycemia",
    "patterns" : 
        [
            "What's hypoglycemia?",
            "define hypoglycemia", 
            "what's the meaning of hypoglycemia?",
            "what does hypoglycemia mean?",
            "Explain hypoglycemia"
        ],
    "responses" : 
        [
            "Hypoglycemia occurs when your blood sugar level drops below your target range. Ask your doctor what's considered a low blood sugar level for you. Blood sugar levels can drop for many reasons, including skipping a meal, eating fewer carbohydrates than called for in your meal plan, getting more physical activity than normal or injecting too much insulin."
        ],
    "context" : [""]
    },
    {"tag" : "hypoglycemia_symptoms",
    "patterns" : 
        [
            "what are the symptoms of hypoglycemia",
            "what are the signs of hypoglycemia",
            "what are the indicators of hypoglycemia",
            "list the symptoms of hypoglycemia", 
            "what are the symptoms of low blood sugar",
            "what are the signs of low blood sugar",
            "what are the indicators of low blood sugar",
            "list the symptoms of low blood sugar"
        ],
    "responses" : 
        [
            "Early signs and symptoms of low blood sugar include:\n  -Sweating\n  -Shaking\n  -Hunger\n  -Dizziness or lightheadedness\n  -Rapid or irregular heart rate\n  -Fatigue\n  -Headaches\n  -Blurred vision\n  -Irritability\n\nLater signs and symptoms of low blood sugar, which can sometimes be mistaken for alcohol intoxication in teens and adults, include:\n  -Lethargy\n  -Confusion\n  -Behavior changes, sometimes dramatic\n  -Poor coordination\n  -Convulsions"
        ],
    "context" : [""]
    },
    {"tag" : "treat_hypoglycemia",
    "patterns" : 
        [
            "what is the best treatment for hypoglycemia?",
            "how to treat hypoglycemia?",
            "how to deal with hypoglycemia?",
            "what's the treatment involved in hypoglycemia?",
            "what's the cure of hypoglycemia?",
            "How to manage hypoglycemia",
            "what is the best treatment for low blood sugar?",
            "how can I treat low blood sugar?",
            "how to deal with low blood sugar?",
            "what's the treatment involved in low blood sugar?",
            "what's the cure of low blood sugar?",
            "How to manage low blood sugar"
        ],
    "responses" : 
        [
            "If you have a low blood sugar reading:\n  -Have 15 to 20 grams of a fast-acting carbohydrate, such as fruit juice, glucose tablets, hard candy, regular (not diet) soda or another source of sugar. Avoid foods with added fat, which don't raise blood sugar as quickly because fat slows sugar absorption.\n  -Retest your blood sugar in about 15 minutes to make sure it's normal.\n  -If it's still low, have another 15 to 20 grams of carbohydrate and retest in another 15 minutes.\n  -Repeat until you get a normal reading.\n  -Eat a mixed food source, such as peanut butter and crackers, to help stabilize your blood sugar."
        ],
    "context" : [""]
    },
    {"tag" : "diabetes_risk_factors",
    "patterns" : 
        [
            "what are the risks that may lead to diabetes",
            "what factors lead to diabetes",
            "what are the risk factors for diabetes", 
            "what are the factors for diabetes",
            "What increases the risk of diabetes",
            "what are the contributing factors to diabetes",
            "what are the contributing factors to this disease",
            "what factors contribute to diabetes"
        ],
    "responses" : 
        [
            "Risk factors for diabetes depend on the type of diabetes.\nYour chances of having prediabetes go up if you:\nAre 45 or older\nHave a parent, brother or sister with diabetes\nAre overweight\nAre physically inactive\nHave high blood pressure or take medicine for high blood pressure\nHave low HDL cholesterol and/or high triglycerides\nHad diabetes during pregnancy\nHave been diagnosed with polycystic ovary syndrome\n\nRisk factors for type 1 diabetes are not as clear as for prediabetes and type 2 diabetes. Known risk factors include:\nFamily history: Having a parent, brother, or sister with type 1 diabetes.\nAge: You can get type 1 diabetes at any age, but it’s more likely to develop when you’re a child, teen, or young adult.\nCurrently, no one knows how to prevent type 1 diabetes.\n\nYou’re at risk for developing type 2 diabetes if you:\nHave prediabetes\nAre overweight\nAre 45 years or older\nHave a parent, brother, or sister with type 2 diabetes\nAre physically active less than 3 times a week\nHave ever had gestational diabetes (diabetes during pregnancy) or given birth to a baby who weighed more than 9 pounds\n\nYou’re at risk for developing gestational diabetes (diabetes while pregnant) if you:\n  Had gestational diabetes during a previous pregnancy\nHave given birth to a baby who weighed more than 9 pounds\n  Are overweight\nAre more than 25 years old\nHave a family history of type 2 diabetes\nHave a hormone disorder called polycystic ovary syndrome (PCOS)",
            "Type 1 : The main things that lead to it are:\n  Family history. If you have relatives with diabetes, chances are higher that you’ll get it, too. Anyone who has a mother, father, sister, or brother with type 1 diabetes should get checked. A simple blood test can diagnose it.\n  Diseases of the pancreas. They can slow its ability to make insulin.\n  Infection or illness. Some infections and illnesses, mostly rare ones, can damage your pancreas.\n\n\nType 2 : The main things that lead to it are:\n  Obesity or being overweight. Research shows this is a top reason for type 2 diabetes. Because of the rise in obesity among U.S. children, this type is affecting more teenagers.\n  Impaired glucose tolerance.Prediabetes is a milder form of this condition. It can be diagnosed with a simple blood test. If you have it, there’s a strong chance you’ll get type 2 diabetes.\n  Insulin resistance.Type 2 diabetes often starts with cells that are resistant to insulin. That means your pancreas has to work extra hard to make enough insulin to meet your body's needs.\n\n\nGestational : Things that can lead to gestational diabetes include:\n  Obesity or being overweight. Extra pounds can lead to gestational diabetes.\n  Glucose intolerance. Having glucose intolerance or gestational diabetes in the past makes you more likely to get it again.\n  Family history. If a parent or sibling has had gestational diabetes, you're more likely to get it.\n  Age. The older you are when you get pregnant, the higher your chances are."
        ],
    "context" : [""]
    }, 
    {"tag" : "diabetes_treatment",
    "patterns" : 
        [
            "what is the best treatment for diabetes?",
            "how can I treat diabetes?",
            "how to deal with diabetes?",
            "what's the treatment involved in diabetes?",
            "what's the cure of diabetes?",
            "How to manage diabetes"
        ],
    "responses" : 
        [
            "Depending on what type of diabetes you have, blood sugar monitoring, insulin and oral medications may play a role in your treatment. Eating a healthy diet, maintaining a healthy weight and participating in regular activity also are important factors in managing diabetes.\nFor type 1 diabetes, insulin is the main treatment as it replaces the hormone your body isn’t able to produce.\n The treatment of type 2 diabetes involves primarily diet and exercise and monitoring of your blood sugar.  If lifestyle changes aren’t enough to lower your blood sugar, you’ll need to take medication.",
            "Treatment for type 1 diabetes involves insulin injections or the use of an insulin pump, frequent blood sugar checks, and carbohydrate counting. Treatment of type 2 diabetes primarily involves lifestyle changes, monitoring of your blood sugar, along with diabetes medications, insulin or both."
        ],
    "context" : [""]
    },
    {"tag" : "type1_treatment",
    "patterns" : 
        [
            "what's the treatment of type 1 diabetes",
            "what's the cure of type 1 diabetes",
            "how to deal with type 1 diabetes",
            "how to manage type 1 diabetes",
            "how to treat type 1 diabetes",
            "is there a cure for type 1 diabetes"
        ],
    "responses" : 
        [
            "Treatment for type 1 diabetes involves insulin injections or the use of an insulin pump, frequent blood sugar checks, and carbohydrate counting.",
            "Treatment for type 1 diabetes includes:\n  -Taking insulin\n  -Carbohydrate, fat and protein counting\n  -Frequent blood sugar monitoring\n  -Eating healthy foods\n  -Exercising regularly and maintaining a healthy weight"
        ],
    "context" : [""]
    },
    {"tag" : "type2_treatment",
    "patterns" : 
        [
            "what's the treatment of type 2 diabetes",
            "what's the cure of type 2 diabetes",
            "how to deal with type 2 diabetes",
            "how to manage type 2 diabetes",
            "how to treat type 2 diabetes",
            "is there a cure for type 2 diabetes"
        ],
    "responses" : 
        [
            "Management of type 2 diabetes includes:\n  -Healthy eating\n  -Regular exercise\n  -Weight loss\n  -Possibly, diabetes medication or insulin therapy\n  -Blood sugar monitoring\n\nThese steps will help keep your blood sugar level closer to normal, which can delay or prevent complications."
        ],
    "context" : [""]
    },
    {"tag" : "change_lifestyle",
    "patterns" : 
        [
            "How can I change my lifestyle to control diabetes",
            "what are some lifestyle changes that can help control diabetes",
            "what are the changes in lifestyle that can help treat diabetes",
            "can we manage diabetes by changing our lifestyle"
        ],
    "responses" : 
        [
            "Working closely with your doctor, you can manage your diabetes by focusing on making changes in your daily life.\n\n  -Eat healthy foods. Choose foods lower in fat and calories and higher in fiber. Focus on fruits, vegetables and whole grains. Strive for variety to prevent boredom.\n  -Get more physical activity. Aim for about 30 minutes of moderate aerobic activity on most days of the week, or at least 150 minutes of moderate aerobic activity a week.\n  -Lose excess pounds. If you're overweight, losing even 7% of your body weight — for example, 14 pounds (6.4 kilograms) if you weigh 200 pounds (90.7 kilograms) — can reduce the risk of diabetes.\nDon't try to lose weight during pregnancy, however. Talk to your doctor about how much weight is healthy for you to gain during pregnancy.\nTo keep your weight in a healthy range, focus on permanent changes to your eating and exercise habits. Motivate yourself by remembering the benefits of losing weight, such as a healthier heart, more energy and improved self-esteem."
        ],
    "context" : [""]
    },
    {"tag" : "define_a1c",
    "patterns" : 
        [
            "what is A1C test",
            "define A1C test", 
            "what's the meaning of A1C test", 
            "what does A1C test mean",
            "Explain A1C test"
        ],
    "responses" : 
        [
            "The A1C (also called HbA1c) is a blood test shows how blood sugar levels were controlled over the previous two to three months. It should be done by your doctor at least twice a year. Aim for a level below 6.5. "
        ],
    "context" : [""]
    },
    {"tag" : "diabetes_test",
    "patterns" : 
        [
            "How do I test for diabetes",
            "what are the tests for diabetes",
            "list the tests available for diabetes"
        ],
    "responses" : 
        [
            "You are considered to have diabetes when either :\n  -your A1C test is 6.5% or greater \n  -your fasting blood glucose is 126 mg/dl or greater \n  -your oral glucose tolerance test is 200 mg/dl or greater"
        ],
    "context" : [""]
    },
    {"tag" : "insulin_types",
    "patterns" : 
        [
            "what are the types of insulin",
            "How many types of insulin are there?",
            "what are the different types of insulin",
            "is all insulin the same"
        ],
    "responses" : 
        [
            "There are four types of insulin that are most commonly used. They’re differentiated by how quickly they start to work, and how long their effects last:\n  -Rapid-acting insulin starts to work within 15 minutes and its effects last for 3 to 4 hours.\n  -Short-acting insulin starts to work within 30 minutes and lasts 6 to 8 hours.\n  -Intermediate-acting insulin starts to work within 1 to 2 hours and lasts 12 to 18 hours.\n  -Long-acting insulin starts to work a few hours after injection and lasts 24 hours or longer."
        ],
    "context" : [""]
    },
    {"tag" : "locate_endocrino",
    "patterns" : [
        "can you find me an endocrinologist in (.*)",
        "locate an endocrinologist in (.*)",
        "is there any endocrinologists in the city of (.*)",
        "find me an endocrinologist in the city of (.*)",
        "look for endocrinologists in (.*)",
        "can you find me an diabetes specialist in (.*)",
        "locate an diabetes specialist in (.*)",
        "is there any diabetes specialist in the city of (.*)",
        "find me an diabetes specialist in the city of (.*)",
        "look for diabetes specialist in (.*)"
    ],
    "responses" : [""],
    "context" : [""]
    },
    {"tag" : "bot_challenge",
    "patterns" : 
        [
            "are you a bot?",
            "are you a human?",
            "am I talking to a bot?",
            "am I talking to a human?"
        ],
    "responses" : 
        [
            "I am a Melli, a chatbot"
        ],
    "context" : [""]
    }
]
}
